app/controllers/blogs_controller.rb

SELECT "users".* FROM "users"
---
  def new
    @blog = Blog.new
    @users = User.all

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = 1 LIMIT 1
SELECT "users".* FROM "users"
---
  def edit
    @blog = Blog.find(params[:id])
    @users = User.all

INSERT INTO "blogs" ("name", "slug", "domain", "description", "created_at", "updated_at", "subdomain") VALUES ('123blog', NULL, NULL, NULL, '2011-06-08 22:04:19.632559', '2011-06-08 22:04:19.632559', 'test123')
---
  def create
    @blog = Blog.new(params[:blog])

    respond_to do |format|
      if @blog.save

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = 1 LIMIT 1
UPDATE "blogs" SET "description" = 'My blog rocks almost.', "updated_at" = '2011-02-21 06:32:05.598685' WHERE "blogs"."id" = 1
---
  def update
    @blog = Blog.find(params[:id])

    respond_to do |format|
      if @blog.update_attributes(params[:blog])