app/controllers/home_controller.rb

SELECT "blogs".* FROM "blogs" WHERE "blogs"."subdomain" = '' LIMIT 1
SELECT "blogs".* FROM "blogs" WHERE ("blogs".site_id = 980190962) LIMIT 1
---
  def find_blog
    if request.subdomain
      @blog=Blog.find_by_subdomain(request.subdomain)
    end
    @blog=Blog.find_by_id!(params[:blog_id]) if @blog.nil?

SELECT "posts".* FROM "posts" WHERE ("posts".blog_id = 980190962) AND (posts.publish_on is not null and posts.publish_on <= '2011-06-08 19:10:57.909876') ORDER BY posts.publish_on DESC LIMIT 10 OFFSET 0
---
  def index
    @posts=@blog.posts.recent.paginate(:per_page => 10,:page => params[:page])