app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE ("posts".blog_id = 980190962) ORDER BY publish_on DESC, created_at DESC LIMIT 10 OFFSET 0
---
  def index
    @posts =@blog.posts.paginate(:per_page=>10,:page => params[:page], :order => 'publish_on DESC, created_at DESC')

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 AND ("posts".blog_id = 1) LIMIT 1
---
  def show
    @post = @blog.posts.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 14 AND ("posts".blog_id = 1) LIMIT 1
---
  def edit
    @post = @blog.posts.find(params[:id])

INSERT INTO "posts" ("title", "story", "publish_on", "created_at", "updated_at", "created_by_id", "updated_by_id", "blog_id") VALUES ('ooga', 'booga', '2011-02-23', '2011-02-23 04:45:42.439377', '2011-02-23 04:45:42.439377', 2, NULL, NULL)
---
  def create
    @post = @blog.posts.new(params[:post])

    logger.info("Post belongs to #{@post.blog}")

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 AND ("posts".blog_id = 1) LIMIT 1
UPDATE "posts" SET "story" = 'asdfsdfasdfsadf', "updated_by_id" = 1, "updated_at" = '2011-03-04 01:24:01.088434' WHERE "posts"."id" = 14
---
  def update
    params[:post][:active_user]= current_user

    @post = @blog.posts.find(params[:id])

    respond_to do |format|
      logger.debug "Post_images: #{ params[:post]}"
      if @post.update_attributes(params[:post])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 980190962 AND ("posts".blog_id = 980190962) LIMIT 1
DELETE FROM "posts" WHERE "posts"."id" = 4
---
  def destroy
    @post = @blog.posts.find(params[:id])
    @post.destroy